blog/2020/08/organizing-source/index.org
#+TITLE: Organizing Source
#+DESCRIPTION: Organizing Workspace/Source Code
#+TAGS: Discussion
#+TAGS: Daily Dispatch
#+TAGS: Organization
#+TAGS: Workspace
#+TAGS: Oral Tradition
#+TAGS: Meta
#+DATE: 2020-08-24
#+SLUG: organizing-source
#+LINK: yesterday-you-said-tomorrow https://kennyballou.com/blog/2020/08/yesterday-you-said-tomorrow
#+LINK: organizing-research https://kennyballou.com/blog/2020/08/organizing-research
#+LINK: gnu-emacs https://www.gnu.org/software/emacs
#+LINK: org-mode https://orgmode.org
#+LINK: visual-studio https://visualstudio.microsoft.com/
#+LINK: eclipse https://www.eclipse.org/
#+LINK: vim https://www.vim.org\
#+LINK: 7-habits-effective-text-editing https://www.youtube.com/watch?v=p6K4iIMlouI
#+LINK: java https://www.oracle.com/java/
#+LINK: maven https://maven.apache.org/
#+LINK: wiki-revisionism https://en.wikipedia.org/wiki/Historical_revisionism
#+LINK: golang https://golang.org/
#+LINK: github https://github.com/
#+LINK: go-modules https://blog.golang.org/using-go-modules
#+LINK: working-in-public https://www.amazon.com/dp/0578675862/
#+LINK: git https://git-scm.com
#+LINK: devault-email-drivn-git https://drewdevault.com/2018/07/02/Email-driven-git.html
#+LINK: devault-federated-git https://drewdevault.com/2018/07/23/Git-is-already-distributed.html
#+LINK: apache https://www.apache.org/
#+LINK: gnome https://www.gnome.org/
#+LINK: dotfiles.git https://github.com/kennyballou/dotfiles
#+LINK: qubesos https://www.qubes-os.org/
#+LINK: archlinux https://www.archlinux.org
#+LINK: gentoo https://gentoo.org
#+LINK: cvs https://www.nongnu.org/cvs/
#+LINK: mercurial https://www.mercurial-scm.org/

#+BEGIN_PREVIEW
Another brief digression into organizing source code and projects.  Described
here is my current ideal, subject to change, that has evolved over the years of
being a student, a professional, a contractor, and now a student again.
#+END_PREVIEW

** Why this Discussion
   :PROPERTIES:
   :ID:       f9211020-9523-43cd-8bf7-86c1b52e9758
   :END:

[[organizing-research][Previously]], we discussed how to organize research papers and related metadata.
Today, I want to discuss how /I/ personally organize my source code.  I write
this because I am occasionally asked about this; but even more personally, I
wish more of these "boring" blog posts were available and easily accessible
from others so that I could learn what/how others are going about this to see
if there is anything I could learn or leverage in my own setup.  My first step
to correcting this is to add my own notes on how and why I organize my
"workspace" the way I do/have.

Many developers and many languages will discuss how to structure an individual
project, or what the best practice are around a specific language or
technology.  However, I have found very, very few discuss the overall structure
of many projects, or more pointedly, or to organize _all_ the different source
trees.  This discussion may implicitly exist in mono-repository vs
poly-repository discussions, but repository organization is still too limiting
to my overall goal of discussing how to organize _every_ project, regardless of
ecosystem or project set.  That is, we set out to answer "how do you organize
all the different projects and ecosystems you're working on or dependent on?"

Perhaps it's important to note that not all projects in a workspace are active
projects but may be dependencies that needed to be adjusted to work with the
current active project set.

I will introduce and discuss the highlights of the development of my
organization and how I arrived or was influenced in a particular direction or
another.  Finally, I will discuss the current organization method.

** Path to Organization
   :PROPERTIES:
   :ID:       3a18713a-359e-4d6b-a667-9ad90752da91
   :END:

The madness of my organization is derivable through a series of tools and
stages in my development career.  Certainly, there is some [[wiki-revisionism][revisionism]] here,
nothing is ever as clean as we may make it.

*** Before University
    :PROPERTIES:
    :ID:       d9a9b147-89ee-4267-94ba-c7e88d4c6194
    :END:

When learning some programming in high-school, there was *NO* organization.
Projects were loosely collected under whatever folder made sense in the moment,
projects captured by "solutions" in [[visual-studio][Visual Studio]].

When I started my first internship, code was collectively organized under
~C:\\dev\~.  This was in the initial developer checklists for configuring a new
machine: something along the lines of "checkout the [[cvs][CVS]] tree to ~C:\\dev\~."

As monstrous and scary as this may sound, this worked.  But it worked for a few
reasons that may make it seem untenable today: this was it.  There was no other
source to deal with.  If it wasn't in our [[cvs][CVS]] tree, there really wasn't any
concern for it at the time.  Outside dependencies didn't really exist.  Aside
from the tooling and libraries of Microsoft, there wasn't much in the realm of
outside dependencies.  Something I find typical of certain enterprise
structures: there is inherent risk associated with and aversion to anything not
controlled by the capital of the enterprise itself.

#+begin_quote
I'm confident things have changed since my time there.  [[mercurial][Mercurial]] is being used
instead of [[cvs][CVS]], for example!
#+end_quote

From this, I used the single tree construct as a foundation of organizing
projects.

*** Eclipse
    :PROPERTIES:
    :ID:       58b4926d-5392-49c5-89b4-f0592215cd65
    :END:

Starting university, our first tool was [[eclipse][Eclipse]].  Being relatively spoiled by
[[visual-studio][Visual Studio]], [[eclipse][Eclipse]] seemed archaic.  But something that stuck out is the
question it asked every time it started that never occurred to me before:
"Select the directory as a workspace".  A very initial hint towards an overall
(meta) structure of projects.

Since I was using [[eclipse][Eclipse]] for essentially all of my school projects, I would
always have a =~/workspace= directory, as a more natural location to place
source, I eventually started placing more programming projects under this
directory structure, even if the projects were not necessarily [[java][Java]]/[[eclipse][Eclipse]]
projects.

Here, I began using the =~/workspace= folder as the foundation for all
organization after this.

