blog/2020/08/organizing-source/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-30 Thu 01:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Organizing Source</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="Organizing Workspace/Source Code"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="https://www.buymeacoffee.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-mug-hot fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">Organizing Source</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge80d892">Why this Discussion</a></li>
<li><a href="#orgc5bd274">Path to Organization</a>
<ul>
<li><a href="#org4ab6ea9">Before University</a></li>
<li><a href="#org6a8573b">Eclipse</a></li>
<li><a href="#org5d67deb">Maven</a></li>
<li><a href="#orgaf4da39">Golang</a></li>
<li><a href="#org8f7a482">Personal Projects, Professional Development, and Contracting</a></li>
<li><a href="#org956dd08">Forges, Platforms, and Working in Public</a></li>
</ul>
</li>
<li><a href="#orgb8d68a1">Organizing Source</a></li>
<li><a href="#org4664f19">tl;dr:</a></li>
<li><a href="#orgcd5892c">Parting Thoughts</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
Another brief digression into organizing source code and projects.  Described
here is my current ideal, subject to change, that has evolved over the years of
being a student, a professional, a contractor, and now a student again.
</p>

</div>

<div id="outline-container-orge80d892" class="outline-2">
<h2 id="orge80d892"><a id="ID-f9211020-9523-43cd-8bf7-86c1b52e9758"></a>Why this Discussion</h2>
<div class="outline-text-2" id="text-orge80d892">
<p>
<a href="https://kennyballou.com/blog/2020/08/organizing-research">Previously</a>, we discussed how to organize research papers and related metadata.
Today, I want to discuss how <i>I</i> personally organize my source code.  I write
this because I am occasionally asked about this; but even more personally, I
wish more of these "boring" blog posts were available and easily accessible
from others so that I could learn what/how others are going about this to see
if there is anything I could learn or leverage in my own setup.  My first step
to correcting this is to add my own notes on how and why I organize my
"workspace" the way I do/have.
</p>

<p>
Many developers and many languages will discuss how to structure an individual
project, or what the best practice are around a specific language or
technology.  However, I have found very, very few discuss the overall structure
of many projects, or more pointedly, or to organize <span class="underline">all</span> the different source
trees.  This discussion may implicitly exist in mono-repository vs
poly-repository discussions, but repository organization is still too limiting
to my overall goal of discussing how to organize <span class="underline">every</span> project, regardless of
ecosystem or project set.  That is, we set out to answer "how do you organize
all the different projects and ecosystems you're working on or dependent on?"
</p>

<p>
Perhaps it's important to note that not all projects in a workspace are active
projects but may be dependencies that needed to be adjusted to work with the
current active project set.
</p>

<p>
I will introduce and discuss the highlights of the development of my
organization and how I arrived or was influenced in a particular direction or
another.  Finally, I will discuss the current organization method.
</p>
</div>
</div>

<div id="outline-container-orgc5bd274" class="outline-2">
<h2 id="orgc5bd274"><a id="ID-3a18713a-359e-4d6b-a667-9ad90752da91"></a>Path to Organization</h2>
<div class="outline-text-2" id="text-orgc5bd274">
<p>
The madness of my organization is derivable through a series of tools and
stages in my development career.  Certainly, there is some <a href="https://en.wikipedia.org/wiki/Historical_revisionism">revisionism</a> here,
nothing is ever as clean as we may make it.
</p>
</div>

<div id="outline-container-org4ab6ea9" class="outline-3">
<h3 id="org4ab6ea9"><a id="ID-d9a9b147-89ee-4267-94ba-c7e88d4c6194"></a>Before University</h3>
<div class="outline-text-3" id="text-org4ab6ea9">
<p>
When learning some programming in high-school, there was <b>NO</b> organization.
Projects were loosely collected under whatever folder made sense in the moment,
projects captured by "solutions" in <a href="https://visualstudio.microsoft.com/">Visual Studio</a>.
</p>

<p>
When I started my first internship, code was collectively organized under
<code>C:\\dev\</code>.  This was in the initial developer checklists for configuring a new
machine: something along the lines of "checkout the <a href="https://www.nongnu.org/cvs/">CVS</a> tree to <code>C:\\dev\</code>."
</p>

<p>
As monstrous and scary as this may sound, this worked.  But it worked for a few
reasons that may make it seem untenable today: this was it.  There was no other
source to deal with.  If it wasn't in our <a href="https://www.nongnu.org/cvs/">CVS</a> tree, there really wasn't any
concern for it at the time.  Outside dependencies didn't really exist.  Aside
from the tooling and libraries of Microsoft, there wasn't much in the realm of
outside dependencies.  Something I find typical of certain enterprise
structures: there is inherent risk associated with and aversion to anything not
controlled by the capital of the enterprise itself.
</p>

<blockquote>
<p>
I'm confident things have changed since my time there.  <a href="https://www.mercurial-scm.org/">Mercurial</a> is being used
instead of <a href="https://www.nongnu.org/cvs/">CVS</a>, for example!
</p>
</blockquote>

<p>
From this, I used the single tree construct as a foundation of organizing
projects.
</p>
</div>
</div>

<div id="outline-container-org6a8573b" class="outline-3">
<h3 id="org6a8573b"><a id="ID-58b4926d-5392-49c5-89b4-f0592215cd65"></a>Eclipse</h3>
<div class="outline-text-3" id="text-org6a8573b">
<p>
Starting university, our first tool was <a href="https://www.eclipse.org/">Eclipse</a>.  Being relatively spoiled by
<a href="https://visualstudio.microsoft.com/">Visual Studio</a>, <a href="https://www.eclipse.org/">Eclipse</a> seemed archaic.  But something that stuck out is the
question it asked every time it started that never occurred to me before:
"Select the directory as a workspace".  A very initial hint towards an overall
(meta) structure of projects.
</p>

<p>
Since I was using <a href="https://www.eclipse.org/">Eclipse</a> for essentially all of my school projects, I would
always have a <code>~/workspace</code> directory, as a more natural location to place
source, I eventually started placing more programming projects under this
directory structure, even if the projects were not necessarily <a href="https://www.oracle.com/java/">Java</a>/<a href="https://www.eclipse.org/">Eclipse</a>
projects.
</p>

<p>
Here, I began using the <code>~/workspace</code> folder as the foundation for all
organization after this.
</p>
</div>
</div>
