blog/2020/08/organizing-source/index.org
*** Maven
    :PROPERTIES:
    :ID:       b74a2024-ab5f-43ef-b24e-e252176d69e2
    :END:

As typical for editor envy, the desire to ditch [[eclipse][Eclipse]] for [[vim][Vim]] became more and
more apparent, finding appropriate tooling for managing projects quickly became
a necessity.

Since I was mainly developing [[java][Java]] projects, [[maven][Maven]] was an obvious contender.
While, at the time I didn't really enjoy the opinionated approach of [[maven][Maven]], the
"correct" domain name ordering stuck out as an interesting idea for organizing
packages in [[java][Java]].  That is, [[maven][Maven]], by default, creates a package structure
similar to the following =com.example.projectx=, which translates to a folder
structure of =src/main/java/com/example/projectx=.

While I didn't end up using [[maven][Maven]] for a little while longer, I did eventually
borrow a modified version of the domain name folder structure.  For example, I
would use =com.example= as a root folder for all ~example.com~ projects.

*** Golang
    :PROPERTIES:
    :ID:       98454288-3c83-4641-a93b-624d76ea277f
    :END:

Prior to 1.12 and Go modules, [[golang][Golang]] imposed its own project structuring.  I
have had conflicting thoughts about this.  On one hand, the imposed homogeneity
of projects and meta-structure was serene since it was always so easy to find
references and dependencies.  On the other hand, it disrupted my current
organization methods.  Furthermore, since I had effectively two different
working trees of source code, I had more mental burden when considering
ownership issues with respect to client or employer code.  With [[golang][Golang]]
projects, it was no longer possible to ensure all source belonging to a
particular organization was under a single tree.

Similarly, related to the homogeneous folder structures was the encoding of the
source repository in the dependency or code base, e.g., projects from [[github][GitHub]] were
found in the folder path ~${GOPATH}/src/github.com/~.

Now that [[go-modules][Go Modules]] are the default and the =${GOPATH}= isn't really used too
much, I did still borrow some of the naming and organization constructs from
[[golang][Golang]].  Chiefly, I now used =~/workspace/src= as the root of all of the projects
instead of simply =~/workspace=.  Furthermore, while I'm not particularly
interested in the platform the source is hosted on (more on this later), I _am_
interested in the owning or overarching organization behind the code.

*** Personal Projects, Professional Development, and Contracting
    :PROPERTIES:
    :ID:       f638a40b-7e43-4c8b-a5ee-6bdece7fbc2a
    :END:

As a developer, hobbyist or professional, there is a need to have a clear
delineation between projects.  This comes both for personal desires to be
organized, but also arises because of contractual reasons; I would rather my
own work not be reassigned to a company just because of being hired (which _is_
what most developer employee contracts argue, though, obligatory "INAL").
Therefore, I need a clear mechanism for delineating ownership.  Thankfully,
this can be baked into the folder structure itself with relative ease!

I mostly stumbled into this since I had started using a personal computer for
one internship and again later when hired full-time, and later when
contracting.  I have tried a few different techniques to sort out the issues of
entangling source from different organizations.

The first I tried was having a separate user account on the machine for work
and personal and this worked well enough but was a pain point for most
everything else.  Namely, my [[dotfiles.git][dotfiles]] game wasn't where it is today, there was
a lot of replicated files between the two user accounts.  Furthermore, this
model does not scale as the number of "engagements" increases.

Another approach I had considered but never tried was using something like
[[qubesos][QubesOS]] since its virtual machine and isolation would functionally achieve
separation very easily.  However, I was worried about how I would accomplish
backups if necessary.  Furthermore, I was really happy with then [[archlinux][Arch Linux]] and
later [[gentoo][Gentoo]].  However, this approach likely would scale better than using
separate accounts, and in some circumstances may be the only (legally) safe way
to achieve separation.

*** Forges, Platforms, and Working in Public
    :PROPERTIES:
    :ID:       b9a222f2-1e66-48db-8209-df35e4c18aa7
    :END:

#+begin_quote
Notice, this _is_ different than the mono-repository vs. poly-repository
discussion.
#+end_quote

As noted, I'm not particularly interested in the hosting platform or forge of a
code base or project.  The source repository may be moved, or there may even be
several different "repositories" that host the code; this is made possible and
evident because [[git][Git's]] [[devault-federated-git][distributed]] nature: there typically /just/ happens to be a
single, "blessed" remote repository that most work is started from, but by
virtue of distribution, [[git][Git]] does not necessitate nor require a single "remote".
Therefore, I prefer to use the owning organization/entity domain name as the
root of organizing ownership.  This could be the ~groupId~ in [[java][Java]] projects, this
could be the parent organization or foundation in the cases of projects under
[[apache][Apache]] or [[gnome][GNOME]], this could be the personal domain of the maintainer, /etc/.

That said, not every project I clone into my workspace seems to require the
same attention to detail.  Therefore, there might be a settling period where
[[github][GitHub]] projects are cloned into the ~com/github/${user}/${repo}~ structure before
being moved to a more permanent home, if at all.

[[git][Git]] itself is better suited and can better handle the tracking of the various
remote repositories for a project.  The filesystem and organization method, on
the other hand, are not well suited to the complexities of remote repository
management (nor should they be).  That is, if I "fork" a project on [[github][GitHub]], I
can add my own remote repository and the upstream source repository into the
same cloned version of the project.

** Organizing Source
   :PROPERTIES:
   :ID:       43d180de-6590-410d-b46f-5c70cf0dd4dc
   :END:

While the historical context may not be complete enough to allow someone to
perfectly derive my own organization, I do hope it serves as a solid foundation
for _why_ the organization is the way it is.

In my home folder, I have a single directory, ~workspace~.  Under this directory,
there is ~src~.  Having ~src~ further allows for the addition of ~docs~ or ~pkgs~, but
I'm not currently using this.  Finally under ~src~ there is the top-level
domains of all the projects I have, e.g., ~com~, ~org~, ~io~, ~net~, /etc/.  Under each
TLD, is the next domain part, e.g., ~io/devnulllabs~, ~com/github~, ~org/kernel~.
Under each of these parent structures is the actual project folders.

