blog/2020/08/organizing-source/index.html

<div id="outline-container-org5d67deb" class="outline-3">
<h3 id="org5d67deb"><a id="ID-b74a2024-ab5f-43ef-b24e-e252176d69e2"></a>Maven</h3>
<div class="outline-text-3" id="text-org5d67deb">
<p>
As typical for editor envy, the desire to ditch <a href="https://www.eclipse.org/">Eclipse</a> for <a href="https://www.vim.org\">Vim</a> became more and
more apparent, finding appropriate tooling for managing projects quickly became
a necessity.
</p>

<p>
Since I was mainly developing <a href="https://www.oracle.com/java/">Java</a> projects, <a href="https://maven.apache.org/">Maven</a> was an obvious contender.
While, at the time I didn't really enjoy the opinionated approach of <a href="https://maven.apache.org/">Maven</a>, the
"correct" domain name ordering stuck out as an interesting idea for organizing
packages in <a href="https://www.oracle.com/java/">Java</a>.  That is, <a href="https://maven.apache.org/">Maven</a>, by default, creates a package structure
similar to the following <code>com.example.projectx</code>, which translates to a folder
structure of <code>src/main/java/com/example/projectx</code>.
</p>

<p>
While I didn't end up using <a href="https://maven.apache.org/">Maven</a> for a little while longer, I did eventually
borrow a modified version of the domain name folder structure.  For example, I
would use <code>com.example</code> as a root folder for all <code>example.com</code> projects.
</p>
</div>
</div>

<div id="outline-container-orgaf4da39" class="outline-3">
<h3 id="orgaf4da39"><a id="ID-98454288-3c83-4641-a93b-624d76ea277f"></a>Golang</h3>
<div class="outline-text-3" id="text-orgaf4da39">
<p>
Prior to 1.12 and Go modules, <a href="https://golang.org/">Golang</a> imposed its own project structuring.  I
have had conflicting thoughts about this.  On one hand, the imposed homogeneity
of projects and meta-structure was serene since it was always so easy to find
references and dependencies.  On the other hand, it disrupted my current
organization methods.  Furthermore, since I had effectively two different
working trees of source code, I had more mental burden when considering
ownership issues with respect to client or employer code.  With <a href="https://golang.org/">Golang</a>
projects, it was no longer possible to ensure all source belonging to a
particular organization was under a single tree.
</p>

<p>
Similarly, related to the homogeneous folder structures was the encoding of the
source repository in the dependency or code base, e.g., projects from <a href="https://github.com/">GitHub</a> were
found in the folder path <code>${GOPATH}/src/github.com/</code>.
</p>

<p>
Now that <a href="https://blog.golang.org/using-go-modules">Go Modules</a> are the default and the <code>${GOPATH}</code> isn't really used too
much, I did still borrow some of the naming and organization constructs from
<a href="https://golang.org/">Golang</a>.  Chiefly, I now used <code>~/workspace/src</code> as the root of all of the projects
instead of simply <code>~/workspace</code>.  Furthermore, while I'm not particularly
interested in the platform the source is hosted on (more on this later), I <span class="underline">am</span>
interested in the owning or overarching organization behind the code.
</p>
</div>
</div>

<div id="outline-container-org8f7a482" class="outline-3">
<h3 id="org8f7a482"><a id="ID-f638a40b-7e43-4c8b-a5ee-6bdece7fbc2a"></a>Personal Projects, Professional Development, and Contracting</h3>
<div class="outline-text-3" id="text-org8f7a482">
<p>
As a developer, hobbyist or professional, there is a need to have a clear
delineation between projects.  This comes both for personal desires to be
organized, but also arises because of contractual reasons; I would rather my
own work not be reassigned to a company just because of being hired (which <span class="underline">is</span>
what most developer employee contracts argue, though, obligatory "INAL").
Therefore, I need a clear mechanism for delineating ownership.  Thankfully,
this can be baked into the folder structure itself with relative ease!
</p>

<p>
I mostly stumbled into this since I had started using a personal computer for
one internship and again later when hired full-time, and later when
contracting.  I have tried a few different techniques to sort out the issues of
entangling source from different organizations.
</p>

<p>
The first I tried was having a separate user account on the machine for work
and personal and this worked well enough but was a pain point for most
everything else.  Namely, my <a href="https://github.com/kennyballou/dotfiles">dotfiles</a> game wasn't where it is today, there was
a lot of replicated files between the two user accounts.  Furthermore, this
model does not scale as the number of "engagements" increases.
</p>

<p>
Another approach I had considered but never tried was using something like
<a href="https://www.qubes-os.org/">QubesOS</a> since its virtual machine and isolation would functionally achieve
separation very easily.  However, I was worried about how I would accomplish
backups if necessary.  Furthermore, I was really happy with then <a href="https://www.archlinux.org">Arch Linux</a> and
later <a href="https://gentoo.org">Gentoo</a>.  However, this approach likely would scale better than using
separate accounts, and in some circumstances may be the only (legally) safe way
to achieve separation.
</p>
</div>
</div>

<div id="outline-container-org956dd08" class="outline-3">
<h3 id="org956dd08"><a id="ID-b9a222f2-1e66-48db-8209-df35e4c18aa7"></a>Forges, Platforms, and Working in Public</h3>
<div class="outline-text-3" id="text-org956dd08">
<blockquote>
<p>
Notice, this <span class="underline">is</span> different than the mono-repository vs. poly-repository
discussion.
</p>
</blockquote>

<p>
As noted, I'm not particularly interested in the hosting platform or forge of a
code base or project.  The source repository may be moved, or there may even be
several different "repositories" that host the code; this is made possible and
evident because <a href="https://git-scm.com">Git's</a> <a href="https://drewdevault.com/2018/07/23/Git-is-already-distributed.html">distributed</a> nature: there typically <i>just</i> happens to be a
single, "blessed" remote repository that most work is started from, but by
virtue of distribution, <a href="https://git-scm.com">Git</a> does not necessitate nor require a single "remote".
Therefore, I prefer to use the owning organization/entity domain name as the
root of organizing ownership.  This could be the <code>groupId</code> in <a href="https://www.oracle.com/java/">Java</a> projects, this
could be the parent organization or foundation in the cases of projects under
<a href="https://www.apache.org/">Apache</a> or <a href="https://www.gnome.org/">GNOME</a>, this could be the personal domain of the maintainer, <i>etc</i>.
</p>

<p>
That said, not every project I clone into my workspace seems to require the
same attention to detail.  Therefore, there might be a settling period where
<a href="https://github.com/">GitHub</a> projects are cloned into the <code>com/github/${user}/${repo}</code> structure before
being moved to a more permanent home, if at all.
</p>

<p>
<a href="https://git-scm.com">Git</a> itself is better suited and can better handle the tracking of the various
remote repositories for a project.  The filesystem and organization method, on
the other hand, are not well suited to the complexities of remote repository
management (nor should they be).  That is, if I "fork" a project on <a href="https://github.com/">GitHub</a>, I
can add my own remote repository and the upstream source repository into the
same cloned version of the project.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb8d68a1" class="outline-2">
<h2 id="orgb8d68a1"><a id="ID-43d180de-6590-410d-b46f-5c70cf0dd4dc"></a>Organizing Source</h2>
<div class="outline-text-2" id="text-orgb8d68a1">
<p>
While the historical context may not be complete enough to allow someone to
perfectly derive my own organization, I do hope it serves as a solid foundation
for <span class="underline">why</span> the organization is the way it is.
</p>

<p>
In my home folder, I have a single directory, <code>workspace</code>.  Under this directory,
there is <code>src</code>.  Having <code>src</code> further allows for the addition of <code>docs</code> or <code>pkgs</code>, but
I'm not currently using this.  Finally under <code>src</code> there is the top-level
domains of all the projects I have, e.g., <code>com</code>, <code>org</code>, <code>io</code>, <code>net</code>, <i>etc</i>.  Under each
TLD, is the next domain part, e.g., <code>io/devnulllabs</code>, <code>com/github</code>, <code>org/kernel</code>.
Under each of these parent structures is the actual project folders.
</p>
</div>
</div>
