blog/2020/08/organizing-source/index.org
** tl;dr:
   :PROPERTIES:
   :ID:       59aadc91-f43d-4dd2-96fc-bc70c82b9b84
   :END:

#+begin_src bash
tree -L 3 ~/workspace
#+end_src

#+begin_example
workspace
└── src
    ├── com
    │   ├── github
    │   └── kennyballou
    ├── dev
    │   └── minilab
    ├── edu
    │   ├── bgsu
    │   └── boisestate
    ├── fi
    │   └── liw
    ├── io
    │   └── devnulllabs
    ├── org
    │   ├── coreboot
    │   ├── gnu
    │   ├── kernel
    │   └── soot-oss
    └── us
        └── crashrec

20 directories, 0 files
#+end_example

** Parting Thoughts
   :PROPERTIES:
   :ID:       be058126-8d00-4112-9c5c-8dcb4142de8f
   :END:

Now that it's all written, I'm not sure this discussion truly warranted its own
post.  I've wanted to read something like this from others before, but in
seeing what it boils down to, I certainly see why no one talks about it.

It's fairly easy to describe the current state of things, it's fairly easy to
demonstrate what it looks like, but it's immensely difficult to distill the
motivation and influences that over 12 years bring us to today.
