blog/2020/08/organizing-source/index.html

<div id="outline-container-org4664f19" class="outline-2">
<h2 id="org4664f19"><a id="ID-59aadc91-f43d-4dd2-96fc-bc70c82b9b84"></a>tl;dr:</h2>
<div class="outline-text-2" id="text-org4664f19">
<div class="org-src-container">
<pre class="src src-bash">tree -L 3 ~/workspace
</pre>
</div>

<pre class="example">
workspace
└── src
    ├── com
    │   ├── github
    │   └── kennyballou
    ├── dev
    │   └── minilab
    ├── edu
    │   ├── bgsu
    │   └── boisestate
    ├── fi
    │   └── liw
    ├── io
    │   └── devnulllabs
    ├── org
    │   ├── coreboot
    │   ├── gnu
    │   ├── kernel
    │   └── soot-oss
    └── us
        └── crashrec

20 directories, 0 files
</pre>
</div>
</div>

<div id="outline-container-orgcd5892c" class="outline-2">
<h2 id="orgcd5892c"><a id="ID-be058126-8d00-4112-9c5c-8dcb4142de8f"></a>Parting Thoughts</h2>
<div class="outline-text-2" id="text-orgcd5892c">
<p>
Now that it's all written, I'm not sure this discussion truly warranted its own
post.  I've wanted to read something like this from others before, but in
seeing what it boils down to, I certainly see why no one talks about it.
</p>

<p>
It's fairly easy to describe the current state of things, it's fairly easy to
demonstrate what it looks like, but it's immensely difficult to distill the
motivation and influences that over 12 years bring us to today.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2022 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
